Autodesk.Revit.DB.View.Duplicate(Autodesk.Revit.DB.ViewDuplicateOption)
Duplicates this viewl
duplicateOption:
The option to use when duplicating the view.
Returns:
The id of the newly created view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be duplicated
Since:
2013